.ssh/templates/vod_is_amdocs.xml

<?xml version='1.0' encoding='UTF-8'?>
<template infosource="amdocs" type="infosource" version="1.0">


    <!-- ############################################################################################## -->
    <!-- Version 1.0                                                                                    -->
    <!--  - Version de partida                                                                          -->
    <!-- ############################################################################################## -->

    <connectivity>

      <troubleshoot>
        <endpoints>
          <endpoint id="consulta_cuenta_cliente" verbose="true" lazy="true" type="ws" connecttimeout="30000" requesttimeout="40000">
            <method>POST</method>
            <url ignoreSSL="true">{url}/ServiceConfigurationREST/serviceConfiguration/search</url>
            <args>
              <arg type="path" id="url">
                  <value type="parameter" parameterid="par_url_bizbus"/>
              </arg>
              <arg type="header" id="Accept">
                  <value type="value"><content>*/*</content></value>
              </arg>
              <arg type="header" id="X-IBM-Client-Id">
                  <value type="parameter" parameterid="par_bizbus_clientid"/>
              </arg>
              <arg type="header" id="X-VF-API-Process">
                  <value type="value"><content>ConsultaCuentaCliente</content></value>
              </arg>
              <arg type="header" id="Content-Type">
                  <value type="value"><content>application/json</content></value>
              </arg>
            </args>
            <body contenttype="text">
              <text>
                <value type="value">
                  <content>
                    <![CDATA[{
                      "queries": [{
                          "query": "$.id.[?(@.schemeID=='COM_MSISDN')].value=]]></content></value><value type="parameter" parameterid="par_context_msisdn_filtered"/><value type="value"><content><![CDATA["
                          }
                      ]
                  }
                  ]]></content></value>
              </text>
            </body>
            <response type="json"/>
          </endpoint>

          <endpoint id="get_msisdn_data" verbose="true" lazy="true" type="ws" connecttimeout="30000" requesttimeout="21000">
            <method>POST</method>              
            <url ignoreSSL="true">{url}/Subscription/SubscriptionService.svc</url>
            <!--<url ignoreSSL="true">https://run.mocky.io/v3/cc92956e-9976-48bf-b005-34da580b9fbc</url>--> <!-- CAD20240104 - PRUEBAS NO SUBIR A OCU/PRO -->
            <args>
              <arg type="path" id="url">
                <value type="parameter" parameterid="par_url_biztalk"/>
              </arg>
              <arg type="header" id="Content-Type">
                <value type="value"><content>application/soap+xml;charset=UTF-8;action="http://group.vodafone.com/contract/vbs/subscription/subscription/v1/get-list"</content></value>
              </arg>
            </args>
            <body contenttype="text">
              <text>
                <value type="value"><content><![CDATA[
                  <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://group.vodafone.com/contract/vho/header/v1" xmlns:v11="http://group.vodafone.com/schema/vbm/subscription/subscription/v1" xmlns:v12="http://group.vodafone.com/schema/common/v1">
                    <soap:Body>
                        <v11:GetSubscriptionListVBMRequest>
                            <v12:Criteria>
                                <v12:QueryExpression>
                                    <v12:ValueExpression Path="/SubscriptionVBO/IDs/ID@schemeName='SerialNumber'" QueryOperatorCode="EQUALS">
                                        <v12:Value>]]></content></value><value type="parameter" parameterid="par_context_msisdn"/><value type="value"><content><![CDATA[</v12:Value>
                                    </v12:ValueExpression>
                                </v12:QueryExpression>
                            </v12:Criteria>
                            <v12:Identification>
                                <v12:Type>0</v12:Type>
                                <v12:Categories>
                                    <v12:Category name="Process">GetMsisdnData</v12:Category>
                                </v12:Categories>
                            </v12:Identification>
                        </v11:GetSubscriptionListVBMRequest>
                    </soap:Body>
                  </soap:Envelope>
                ]]></content></value>
              </text>
            </body>
            <response type="xml2json1"/>
          </endpoint>

          <endpoint id="get_billing_data" verbose="true" lazy="true" type="ws" connecttimeout="30000" requesttimeout="21000">
            <method>POST</method>              
            <url ignoreSSL="true">{url}/BillingAccount/BillingAccount.svc</url>
            <args>
              <arg type="path" id="url">
                <value type="parameter" parameterid="par_url_biztalk"/>
              </arg>
              <arg type="header" id="Content-Type">
                <value type="value"><content>application/soap+xml;charset=UTF-8;action="GetBillingAccountList"</content></value>
              </arg>
            </args>
            <body contenttype="text">
              <text>
                <value type="value"><content><![CDATA[
                  <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://group.vodafone.com/contract/vho/header/v1" xmlns:v11="http://group.vodafone.com/schema/common/v1" xmlns:urn="urn:un:unece:uncefact:documentation:standard:CoreComponentType:2" xmlns:v2="http://group.vodafone.com/schema/vbm/customer/billing-account/v2">
                    <soap:Header>
                      <v1:Source>
                        <v1:System>Schaman</v1:System>
                      </v1:Source>
                    </soap:Header>
                    <soap:Body>
                      <v2:GetBillingAccountListVBMRequest>
                        <v11:Criteria>
                          <v11:QueryExpression>
                            <v11:QueryExpression>
                              <v11:ValueExpression Path="/BillingAccountVBO/ID">
                                <v11:Value>]]></content></value><value type="parameter" role="front" parameterid="par_ccc_client_id"/><value type="value"><content><![CDATA[</v11:Value>
                              </v11:ValueExpression>
                            </v11:QueryExpression>
                          </v11:QueryExpression>
                        </v11:Criteria>
                        <v11:Identification>
                          <v11:Categories>
                            <v11:Category name="Process">GetBillingData</v11:Category>
                          </v11:Categories>
                        </v11:Identification>
                      </v2:GetBillingAccountListVBMRequest>
                    </soap:Body>
                  </soap:Envelope>
                ]]></content></value>
              </text>
            </body>
            <response type="xml2json1"/>
          </endpoint>

          <endpoint id="consulta_puk" verbose="true" lazy="true" type="ws" connecttimeout="30000" requesttimeout="40000">
            <method>POST</method>
            <url ignoreSSL="true">{url}/ResourceInventoryREST/resourceInventory/search</url>
            <args>
              <arg type="path" id="url">
                <value type="parameter" parameterid="par_url_bizbus"/>
              </arg>
              <arg type="header" id="Accept">
                <value type="value"><content>*/*</content></value>
              </arg>
              <arg type="header" id="X-IBM-Client-Id">
                <value type="parameter" parameterid="par_bizbus_clientid"/>
              </arg>
              <arg type="header" id="X-VF-API-Process">
                <value type="value"><content>consultaPUK</content></value>
              </arg>
              <arg type="header" id="Content-Type">
                <value type="value"><content>application/json</content></value>
              </arg>
            </args>
            <body contenttype="text">
              <text>
                <value type="value">
                  <content>
                    <![CDATA[{
                        "queries": [
                        {
                          "query": "$.id[?(@.schemeName=='COM_SIM')].value=]]></content></value><value type="parameter" role="front" parameterid="par_sim"/><value type="value"><content><![CDATA["
                        },
                        {
			                    "query": "$.type=SIM"
		                    },
                        {
                          "query": "$.parts.resource.id[?(@.schemeName=='ACP_USUARIO')].value=Consola Schaman"
                        },
                        {
                          "query": "$.parts.resource.id[?(@.schemeName=='APR_CANAL')].value=Schaman"
                        }
                        ]
                    }]]>
                  </content>
                </value>
              </text>
            </body>
            <response type="json"/>
          </endpoint>

          <endpoint id="GSOL" verbose="true" lazy="true" type="ws" connecttimeout="30000" requesttimeout="2000">
            <method>POST</method>
            <url ignoreSSL="true">{url}/SalesOrderSOAP12/GetSalesOrderList</url>
            <args>
              <arg type="path" id="url">
                <value type="parameter" parameterid="par_url_bizbus"/>
              </arg>
              <arg type="header" id="Content-Type">
                <value type="value"><content>application/soap+xml;charset=UTF-8;action="http://group.vodafone.com/contract/vbs/order/sales-order/v2/get-list"</content></value>
              </arg>
              <arg type="header" id="X-IBM-Client-Id">
                <value type="parameter" parameterid="par_bizbus_clientid"/>
              </arg>
              <arg type="header" id="Connection">
                <value type="value"><content>Keep-Alive</content></value>
              </arg>
            </args>
            <body contenttype="text">
              <text>
                <value type="value"><content><![CDATA[<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://group.vodafone.com/contract/vho/header/v1" xmlns:v2="http://group.vodafone.com/schema/vbm/order/sales-order/v2" xmlns:v11="http://group.vodafone.com/schema/common/v1"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Action>http://group.vodafone.com/contract/vbs/order/sales-order/v2/get-list</wsa:Action></soap:Header>
                  <soap:Body>
                      <v2:GetSalesOrderListVBMRequest>
                        <v11:Criteria>
                            <v11:QueryExpression>
                              <v11:QueryExpression>
                                  <v11:ValueExpression Path="/SalesOrderVBO/Categories/Category/@listName='Process'">
                                    <v11:Value>QueryOT</v11:Value>
                                  </v11:ValueExpression>
                              </v11:QueryExpression>
                              <v11:QueryExpression>
                                  <v11:ValueExpression Path="/SalesOrderVBO/Roles/Customer/IDs/ID/@schemeName='ID'">
                                    <v11:Value>]]></content></value><value type="parameter" role="front" parameterid="par_ccc_client_id"/><value type="value"><content><![CDATA[</v11:Value>
                                  </v11:ValueExpression>
                              </v11:QueryExpression>
                            </v11:QueryExpression>
                        </v11:Criteria>
                      </v2:GetSalesOrderListVBMRequest>
                  </soap:Body>
                </soap:Envelope>]]></content></value>
              </text>
            </body>
            <response type="xml2json1"/>
          </endpoint>

          <endpoint id="consulta_portabilidad" verbose="true" lazy="true" type="ws" connecttimeout="30000" requesttimeout="40000">
            <method>POST</method>
            <url ignoreSSL="true">{url}/ServiceConfigurationREST/serviceConfiguration/search</url>
            <args>
              <arg type="path" id="url">
                  <value type="parameter" parameterid="par_url_bizbus"/>
              </arg>
              <arg type="header" id="Accept">
                  <value type="value"><content>*/*</content></value>
              </arg>
              <arg type="header" id="X-IBM-Client-Id">
                  <value type="parameter" parameterid="par_bizbus_clientid"/>
              </arg>
              <arg type="header" id="X-VF-API-Process">
                  <value type="value"><content>ConsultaPortabilidad</content></value>
              </arg>
              <arg type="header" id="Content-Type">
                  <value type="value"><content>application/json</content></value>
              </arg>
            </args>
            <body contenttype="text">
              <text>
                <value type="value">
                  <content>
                    <![CDATA[{
                      "queries":  [
                          {
                      "query":  "$.id[?(@.schemeName='MSISDN')].value=]]></content></value><value type="parameter" parameterid="par_com_msisdn" role="front"/><value type="value"><content><![CDATA["
                          },
                          {
                      "query":  "$.parts.service.resource[*].id[?(@.schemeName='Tipo')].value=Movil"
                          }
                      ]
                      }
                  ]]></content></value>
              </text>
            </body>
            <response type="json"/>
          </endpoint>
        </endpoints>
      </troubleshoot>
      
      <action>
        <endpoints>
        </endpoints>
      </action>

    </connectivity>

    <parameters>
      <!-- ENDPOINT REQUEST PARAMETERS -->
      <parameter id="par_url_bizbus">
        <contents>
          <value type="lookup">url_list</value>
        </contents>
        <sequence>
          <operation type="row_delimiter">
            <args><arg><value type="value">;</value></arg></args>
          </operation>
          <operation type="column_delimiter">
            <args><arg><value type="value">,</value></arg></args>
          </operation>
          <operation type="column_index">
            <args><arg><value type="value">1</value></arg></args>
          </operation>
          <operation type="column_equal">
            <args><arg><value type="value">url_bizbus</value></arg></args>
          </operation>
          <operation type="column_selector">
            <args><arg><value type="value">2</value></arg></args>
          </operation>
        </sequence>
      </parameter>

      <parameter id="par_url_biztalk">
        <contents>
          <value type="lookup">url_list</value>
        </contents>
        <sequence>
          <operation type="row_delimiter">
            <args><arg><value type="value">;</value></arg></args>
          </operation>
          <operation type="column_delimiter">
            <args><arg><value type="value">,</value></arg></args>
          </operation>
          <operation type="column_index">
            <args><arg><value type="value">1</value></arg></args>
          </operation>
          <operation type="column_equal">
            <args><arg><value type="value">url_biztalk</value></arg></args>
          </operation>
          <operation type="column_selector">
            <args><arg><value type="value">2</value></arg></args>
          </operation>
        </sequence>
      </parameter>

      <parameter id="par_bizbus_clientid">
          <contents>
            <value type="lookup">url_list</value>
          </contents>
          <sequence>
            <operation type="row_delimiter">
              <args><arg><value type="value">;</value></arg></args>
            </operation>
            <operation type="column_delimiter">
              <args><arg><value type="value">,</value></arg></args>
            </operation>
            <operation type="column_index">
              <args><arg><value type="value">1</value></arg></args>
            </operation>
            <operation type="column_equal">
              <args><arg><value type="value">url_bizbus</value></arg></args>
            </operation>
            <operation type="column_selector">
              <args><arg><value type="value">3</value></arg></args>
            </operation>
          </sequence>
      </parameter>

      <parameter id="par_context_msisdn" type="value" name="MSISDN">
        <contents>
          <value type="context">ipt_service_id</value>
        </contents>
      </parameter>

      <parameter id="par_context_msisdn_filtered" type="value">
        <contents>
          <value type="parameter">par_context_msisdn</value>
        </contents>
        <sequence>
          <operation type="replace_pattern">
            <args><arg><value type="value">^9(\S.*)@to@unknown</value></arg></args>
          </operation>
        </sequence>
      </parameter>
    </parameters>

    <checks>
    </checks>

</template>
